#include "Render.h"
#include "Bullet.h"
#include "Timer.h"
#include "Sound.h"
#include "Player.h"
#include "Monster.h"
#include <windows.h>

#define LOADING_TIME 3

void LoadingPage1()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage2()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}

void LoadingPage3()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage4()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage5()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡á¡á¡á¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage6()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡à¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage7()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡á¡à¡à¡á¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡à¡á¡á¡á¡á¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage8()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage9()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡à¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage10()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡à¡à¡à¡à¡à¡à¡á¡á¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage11()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡á¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage12()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡à¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}
void LoadingPage13()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡á¡à¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡á¡á¡á¡à¡à¡á¡á¡à¡á¡à¡á¡à¡à¡á¡à¡à¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡á¡à¡à¡à¡á¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡á¡á¡á¡à¡á¡á¡à¡à¡á¡à¡á¡à¡à¡á¡à¡á¡á¡á¡à¡á¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
}

void Loadingbar()
{
	static int cnt = 0;
	int i;
	print(0, 0, "|", WHITE);
	for (i = 1; i < cnt; i++)
		print(0, 0, "¡á", WHITE);
	print(0, 0, "|", WHITE);
	cnt++;

}

void GameOverPage()
{
	print(0, 0, "1 2 3 4 5 6 7 8 9 1 1 2 3 4 5 6 7 8 9 1 1 2 3 4 5 6 7 8 9 1 1 2 3 4 5 6 7 8 9 1 1 2 3 4 5 6 7 8 9 1", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                ¢¾                                                  ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);

}
void GameOverPage1()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                              ¡¬  /                                                 ", WHITE);
	print(0, 0, "                                                ¢½                                                  ", WHITE);
	print(0, 0, "                                               /  ¡¬                                                ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);

}
void GameOverPage2()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                            ¡¬     /                                                ", WHITE);
	print(0, 0, "                                              ¡¬  /                                                 ", WHITE);
	print(0, 0, "                                            --  ¡¤ --                                               ", WHITE);
	print(0, 0, "                                               /  ¡¬                                                ", WHITE);
	print(0, 0, "                                              /     ¡¬                                              ", WHITE);

}
void GameOverPage3()
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                            ¡¬     /                                                ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                            -       -                                               ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                             /     ¡¬                                               ", WHITE);

}
void GameOverPage(float playtime)
{
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "¡à¡à¡á¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡à¡à¡à¡á¡á¡à¡à¡à¡á¡à¡á¡à¡à¡á¡á¡à¡à¡à¡á¡à¡à¡à¡à¡á¡á¡à¡à¡à¡á¡à¡á¡á¡à¡á¡à¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡à¡à¡à¡á¡á¡á¡à¡à¡á¡à¡á¡à¡á¡à¡á¡á¡á¡á¡á¡à¡à¡á¡à¡à¡à¡à¡á¡á¡á¡à¡á¡á¡á¡á¡á¡á¡á¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡á¡á¡à¡à¡à¡á¡á¡à¡à¡á¡à¡á¡à¡á¡à¡á¡á¡à¡à¡à¡à¡à¡á¡á¡à¡à¡á¡á¡à¡á¡á¡á¡à¡á¡à¡à¡à¡á¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡á¡á¡á¡á¡à¡à¡á¡á¡á¡á¡á¡à¡á¡à¡á¡à¡á¡á¡á¡à¡à¡à¡á¡á¡á¡á¡à¡à¡à¡á¡à¡à¡à¡á¡á¡á¡á¡à¡à¡à¡à¡á¡à¡á¡à¡á¡à¡à", WHITE);
	print(0, 0, "¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à¡à", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);
	print(0, 0, "                                                                                                    ", WHITE);


	print(0, 80, "                                                                                                    ", WHITE);
}
int main()
{
	float loading_startTime;
	float ingame_startTime;
	float playTime;
	Render_Init();
	Bullet_Init();
	Monster_Init();
	Timer_Start();
	Sound_PlayIngameBGM();
	
	loading_startTime = Timer_Now();
	
	while (Timer_Now() - loading_startTime  < LOADING_TIME)
	{
		Render(70);
		LoadingPage1();
		Loadingbar();
		Render(70);
		LoadingPage2();
		Loadingbar();
		Render(70);
		LoadingPage3();
		Loadingbar();
		Render(70);
		LoadingPage4();
		Loadingbar();
		Render(70);
		LoadingPage5();
		Loadingbar();
		Render(70);
		LoadingPage6();
		Loadingbar();
		Render(70);
		LoadingPage7();
		Loadingbar();
		Render(70);
		LoadingPage8();
		Loadingbar();
		Render(70);
		LoadingPage9();
		Loadingbar();
		Render(70);
		LoadingPage10();
		Loadingbar();
		Render(70);
		LoadingPage11();
		Loadingbar();
		Render(70);
		LoadingPage12();
		Loadingbar();
		Render(70);
		LoadingPage13();
		Loadingbar();

	}
	
	ingame_startTime = Timer_Now();
	int dt = Timer_Now();
	while (1)
	{
		Render(dt);
		if(!Player_Update())
			break;
		Bullet_Update();
		Monster_Update();
		CirclePatton_Update();
		dt = Timer_Now() - dt;
	}
	playTime = Timer_Now() - ingame_startTime;
	Render(500);
	GameOverPage1();
	Render(500);
	GameOverPage2();
	Render(500);
	GameOverPage3();
	while (1)
	{
		Render(1000);
		GameOverPage(playTime);
	}
		
	
}